/*******************************************************************************
* osa_file.h
*
* Copyright (C) 2015-2017 xxx Technology CO.,LTD.
*
* Author : menki
* Version: V1.0.0  2016-7-18 Create
*
* Desc: 实现SD卡模块对外提供的文件操作接口
*
* Modification: 
*    Date    :  
*    Revision:
*    Author  :
*    Contents:
*******************************************************************************/

/******************************接口调用流程*************************************
OSA_fileInit
      |
OSA_getSdSize
OSA_removeFile
      |
OSA_fileOpen
      |
OSA_fileSeek/OSA_fileRead/OSA_fileWrite
      |
OSA_fileSync
      |
OSA_fileClose
      |
OSA_fileDeInit
*******************************************************************************/


#ifndef _OSA_FILE_H_
#define _OSA_FILE_H_


/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */

/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */
/*文件句柄类型,上层模块不需要关心其中的具体内容,*/
/*只需要在调用各文件操作接口时把句柄传入即可*/
typedef void * OSA_FileHandle;

/* 文件的操作模式*/
typedef enum
{
    OSA_FILEMODE_RDONLY  = 0, /* 只读, 若文件不存在将失败 */
    OSA_FILEMODE_WRONLY,      /* 只写*/
    OSA_FILEMODE_RDWR,        /* 读写,从文件头开始写,原有数据将被清掉, 若文件不存在将创建*/
} OSA_FileMode;

/* 接口返回值定义 */
#define OSA_OK      0
#define OSA_EFAIL  -1

/*魔数,用于校验句柄有效性。*/
#define OSA_MAGIC_NUM  0x5a5a


//SD卡容量信息
typedef struct 
{							  
	unsigned int totalSize;		//总容量，单位M
	unsigned int availableSize;	//剩余可用容量，单位M
}SD_sizeInfo;

/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */
/*******************************************************************************
* 函数名  : OSA_fileInit
* 描  述  : 该函数初始化系统文件系统
* 输  入  : 无
* 输  出  : 无
* 返回值  : OSA_EFAIL: 失败
*           OSA_SOK:   成功
*******************************************************************************/
int OSA_fileInit(void);

/*******************************************************************************
* 函数名  : OSA_fileDeInit
* 描  述  : 该函数反初始化系统文件系统
* 输  入  : 无
* 输  出  : 无
* 返回值  : OSA_EFAIL: 失败
*           OSA_SOK:   成功
*******************************************************************************/
int OSA_fileDeInit(void);


/*******************************************************************************
* 函数名  : OSA_getSdSize
* 描  述  : 文件空间占用情况
* 输  入  : 无
* 输  出  : 无
* 返回值  : OSA_EFAIL: 失败
*           OSA_SOK:   成功
*******************************************************************************/
int OSA_getSdSize(SD_sizeInfo *pSdSizeInfo);

/*******************************************************************************
* 函数名  : OSA_removeFile
* 描  述  : 删除指定文件
* 输  入  : 无
* 输  出  : 无
* 返回值  : OSA_SOK:   删除成功
*           OSA_EFAIL: 删除失败
*******************************************************************************/
int OSA_removeFile(const char *pName);

/*******************************************************************************
* 函数名  : OSA_fileOpen
* 描  述  : 该函数负责打开一个文件,支持四种操作模式: 只读、只写、读写创建、追加写
*           若文件打开成功,将返回一个文件句柄,供调用其他文件操作接口时传入
*           该函数不能在内核态中断上下文调用
*
* 输  入  : - fileName: 包含文件路径信息的完整文件名
*           - mode:     文件操作模式,参见OSA_FileMode定义
*
* 输  出  : - phFile:   文件句柄指针,当打开成功时输出文件句柄
* 返回值  :  OSA_SOK:   打开成功
*            OSA_EFAIL: 打开失败
*******************************************************************************/
int OSA_fileOpen(const char *fileName, OSA_FileMode mode, 
                    OSA_FileHandle *phFile);

/*******************************************************************************
* 函数名  : OSA_fileClose
* 描  述  : 该函数负责关闭一个文件,将销毁文件句柄指向的对象,
*           因此调用该接口后原有的文件句柄不能再使用。
*           该函数不能在内核态中断上下文调用
*
* 输  入  : - hFile: 文件句柄
* 输  出  : 无
* 返回值  : OSA_SOK:   关闭成功
*           OSA_EFAIL: 关闭失败
*******************************************************************************/
int OSA_fileClose(OSA_FileHandle hFile);


/*******************************************************************************
* 函数名  : OSA_fileRead
* 描  述  : 该函数负责实现文件的读操作,读缓冲必须由调用者申请,且调用者必须保证
*           buffer的长度要大于等于size
*           该函数不能在内核态中断上下文调用
*
* 输  入  : - hFile:   文件句柄
*           - buffer:  读缓冲区
*           - size:    要读取的长度
* 输  出  : 无
* 返回值  : OSA_EFAIL: 读取失败
*           >= 0:      真正读取的字节数
*******************************************************************************/
int OSA_fileRead (OSA_FileHandle hFile,unsigned char *buffer, unsigned int size);

/*******************************************************************************
* 函数名  : OSA_fileWrite
* 描  述  : 该函数负责实现文件的写操作,缓冲区buffer必须由调用者申请,且调用者必须保证
*           buffer的长度要大于等于size
*           该函数不能在内核态中断上下文调用
*
* 输  入  : - hFile:   文件句柄
*           - buffer:  写缓冲区
*           - size:    要写入的长度
* 输  出  : 无
* 返回值  : OSA_EFAIL: 写入失败
*           >= 0:      真正写入的字节数
*******************************************************************************/
int OSA_fileWrite(OSA_FileHandle hFile, unsigned char *buffer, unsigned int size);

/*******************************************************************************
* 函数名  : OSA_fileSeek
* 描  述  : 该函数负责实现文件的Seek操作
*
* 输  入  : - hFile:   文件句柄
*           - offset:  seek的从文件头偏移字节数
* 输  出  : 无
* 返回值  : OSA_EFAIL: seek失败
*           OSA_SOK:   seek成功
*******************************************************************************/
int OSA_fileSeek (OSA_FileHandle hFile,unsigned int offset);

/*******************************************************************************
* 函数名  : OSA_fileSync
* 描  述  : 该函数负责将文件缓冲里的数据刷到硬件。
*
* 输  入  : - hFile: 文件句柄
* 输  出  : 无
* 返回值  : OSA_SOK:   成功
*           OSA_EFAIL: 失败
*******************************************************************************/
int OSA_fileSync(OSA_FileHandle hFile);

#endif  /*  _OSA_FILE_H_  */

